cask_args appdir: "/Applications", require_sha: true

# All taps first
tap "supabase/tap"
tap "asmvik/formulae"
tap "jackielii/tap"
tap "1password/tap"

brew "docker"
brew "docker-compose"
brew "neovim"
brew "node"
brew "python@3.11"
brew "python-tk"
brew "pgcli"
brew "ripgrep"
brew "tree"
brew "bash"
brew "tmux"
brew "tpm"
brew "deno"
brew "pnpm"
brew "chafa"
brew "fzf"

brew "rustup"
brew "goenv"

brew "stylua"

brew "fileicon"

cask "claude-code"

cask "darktable"
cask "rawtherapee"

brew "supabase"

brew "yabai"

brew "skhd-zig"

cask "hiddenbar"
cask "stats"
cask "firefox"
cask "zen"
cask "iterm2"
cask "hazel"
cask "love"

cask "1password-cli"
cask "1password"

cask "karabiner-elements"
cask "font-hack-nerd-font"
cask "alfred"
cask "discord"
cask "slack"
cask "gimp"
cask "telegram"
cask "microsoft-word"
cask "microsoft-powerpoint"
cask "microsoft-excel"
cask "visual-studio-code"
cask "figma"
cask "postman"
cask "protonvpn"
cask "transmission"
cask "alacritty"
cask "obsidian"
cask "subler"

mas "things 3", id: 904280696
mas "magnet", id: 441258766
mas "1password for safari", id: 1569813296
mas "keys for safari", id: 1494642810
mas "vinegar", id: 1591303229
mas "baking soda", id: 1601151613
mas "refined github", id: 1519867270
mas "dearrow", id: 6451469297
mas "wappalyzer", id: 1520333300
mas "trello", id: 1278508951
mas "dropover", id: 1355679052

# For work

brew "pulumi"
cask "gcloud-cli"
