cask_args appdir: "/Applications", require_sha: true

tap "homebrew/bundle"

brew "docker"
brew "docker-compose"
brew "neovim"
brew "node"
brew "python@3.11"
brew "python-tk"
brew "pgcli"
brew "ripgrep"
brew "tree"
brew "tmux"
brew "tpm"
brew "deno"
brew "pnpm"

brew "rustup"
brew "goenv"

brew "stylua"

tap "supabase/tap"
brew "supabase"
untap "supabase"

tap "koekeishiya/formulae"
brew "yabai"
brew "skhd"
untap "koekeishiya/formulae"

cask "stats"
cask "firefox"
cask "iterm2"
cask "hazel"

tap "1password/tap"
cask "1password-cli"
cask "1password"
untap "1password/tap"

cask "karabiner-elements"
cask "font-hack-nerd-font"
cask "alfred"
cask "discord"
cask "slack"
cask "gimp"
cask "telegram"
cask "microsoft-word"
cask "microsoft-powerpoint"
cask "microsoft-excel"
cask "visual-studio-code"
cask "figma"
cask "postman"
cask "protonvpn"
cask "transmission"
cask "alacritty"
cask "obsidian"
cask "subler"

mas "things 3", id: 904280696
mas "magnet", id: 441258766
mas "1password for safari", id: 1569813296
mas "effortless", id: 1368722917
mas "keys for safari", id: 1494642810
mas "vinegar", id: 1591303229
mas "baking soda", id: 1601151613
mas "omnivore reader", id: 1564031042
mas "wireless@sg", id: 1449928544
mas "refined github", id: 1519867270
mas "dearrow", id: 6451469297
mas "duolingo", id: 570060128
mas "wappalyzer", id: 1520333300
